src/Reports/ВМИДляПоставщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>ВМИДляПоставщика</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/AccumulationRegisters/ПартииТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРубли</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДоллары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЕвро</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВнутреннееПеремещение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиВДокументе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаПрихода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокПриходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/InformationRegisters/ЦеныНоменклатурыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатурыКонтрагентов</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АртикулПоставщика</Name>
					<Comment>Удалить - реквизит НоменклатурыКонтрагента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзготовительПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Изготовители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПрайсПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрайсыПоставщиков</v8:Type>
						<v8:Type>cfg:CatalogRef.ПрайсыПоставщиковVMI</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ВидыПоступленияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыПоступленияТоваров</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаСклад</Name>
					<Comment>(Общ) Поступление на склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комиссия</Name>
					<Comment>(Общ) Поступление на склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветХранение</Name>
					<Comment>(Упр) Поступление товара VMI</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗачетТовараVMI</Name>
					<Comment>(Упр) Зачет продажи товара VMI</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Импорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтатусыПартии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СтатусыПартии</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Собственный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятыйНаОтветХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятыйНаКомиссию</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровКонтрагентов</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаЭкспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветХранение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ПереоценкаОстатковПоставщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПереоценкаОстатковПоставщика</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныНоменклатурыКонтрагентов</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрайсПоставщикаVMI</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрайсыПоставщиковVMI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданВ77</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкиПриЗагрузке</Name>
					<Comment>хранит не загруженные артикулы поставщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Качество</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Качество</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСтарая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаНовая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>флНеПереоценивать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаПрихода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокПриходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТоварыПоставщика</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АртикулПоставщика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИзготовительПоставщика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураПоставщика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСтарая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентОтклонения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеПереоценивать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Reports/ВМИДляПоставщика/Ext/ObjectModule.bsl
Функция ОстаткиДляСайта(Контрагент,Склад,НачалоПериода,КонецПериода) Экспорт
	
	Попытка
		Период=КонецДня(ТекущаяДата());
		Если Строка(Контрагент)="" Тогда 
			Сообщить("Укажите контрагента!",СтатусСообщения.ОченьВажное);
			Отказ=Истина;
			СтрукураВозврата = Новый Структура;
			СтрукураВозврата.Вставить("Результат",Новый ТаблицаЗначений);
			СтрукураВозврата.Вставить("Ошибка",Отказ);
			СтрукураВозврата.Вставить("ОписаниеОшибк","Нет контрагента в запросе");
			Возврат СтрукураВозврата;
		КонецЕсли;	
		//Если Строка(Склад)="" Тогда 
		//	Предупреждение("Укажите склад!");
		//	Отказ=Истина;
		//	Возврат
		//КонецЕсли;	
		Запрос=Новый Запрос;
		
		Запрос.Текст=
		"ВЫБРАТЬ
		|	ПоступлениеТоваровУслуг.Номенклатура КАК Номенклатура,
		|	СУММА(ПоступлениеТоваровУслуг.Количество) КАК Приход,
		|	СУММА(0) КАК Расход,
		|	ПоступлениеТоваровУслуг.Номенклатура.Артикул КАК Артикул,
		|	ПоступлениеТоваровУслуг.Номенклатура.Изготовитель КАК Изготовитель,
		|	СУММА(ПоступлениеТоваровУслуг.КоличествоНеПринято) КАК НеПринято,
		|	СУММА(ПоступлениеТоваровУслуг.КоличествоРазмещено) КАК Размещено,
		|	СУММА(0) КАК Цена,
		|	ПоступлениеТоваровУслуг.Ссылка.Склад,
		|	СУММА(0) КАК Остаток,
		|	ВложенныйЗапрос.АртикулПоставщика,
		|	ВложенныйЗапрос.ИзготовительПоставщика
		|ИЗ
		|	(ВЫБРАТЬ
		|		НоменклатураКонтрагентов.Номенклатура КАК Номенклатура,
		|		НоменклатураКонтрагентов.Артикул КАК Артикул,
		|		НоменклатураКонтрагентов.Изготовитель КАК Изготовитель,
		|		НоменклатураКонтрагентов.АртикулПоставщика КАК АртикулПоставщика,
		|		НоменклатураКонтрагентов.ИзготовительПоставщика КАК ИзготовительПоставщика
		|	ИЗ
		|		Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
		|	ГДЕ
		|		НоменклатураКонтрагентов.Владелец = &Контрагент) КАК ВложенныйЗапрос
		|		ПРАВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслуг
		|		ПО ВложенныйЗапрос.Номенклатура = ПоступлениеТоваровУслуг.Номенклатура
		|ГДЕ
		|	ПоступлениеТоваровУслуг.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ПоступлениеТоваровУслуг.Ссылка.Проведен = ИСТИНА
		|	И ПоступлениеТоваровУслуг.Ссылка.ВидОперацииПоступления = &ВидОперацииVMI
		|	И ПоступлениеТоваровУслуг.Ссылка.ДоговорКонтрагента.ВидДоговора = &ВидДоговора
		|	И ПоступлениеТоваровУслуг.Ссылка.Контрагент = &Контрагент";
		Если НЕ Строка(Склад)="" Тогда 
			Запрос.Текст=Запрос.Текст+"
			|	И ПоступлениеТоваровУслуг.Ссылка.Склад = &Склад";
		КонецЕсли;	
		Запрос.Текст=Запрос.Текст+"
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.АртикулПоставщика,
		|	ПоступлениеТоваровУслуг.Ссылка.Склад,
		|	ВложенныйЗапрос.ИзготовительПоставщика,
		|	ПоступлениеТоваровУслуг.Номенклатура,
		|	ПоступлениеТоваровУслуг.Номенклатура.Артикул,
		|	ПоступлениеТоваровУслуг.Номенклатура.Изготовитель
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура";
		
		Запрос.УстановитьПараметр("ВидОперацииVMI",Перечисления.ВидыПоступленияТоваров.ОтветХранение);
		Запрос.УстановитьПараметр("НачалоПериода",НачалоДня(НачалоПериода));
		Запрос.УстановитьПараметр("КонецПериода",КонецДня(КонецПериода));
		Запрос.УстановитьПараметр("Склад",Склад);
		Запрос.УстановитьПараметр("СтатусПартии",Перечисления.СтатусыПартии.ПринятыйНаОтветХранение);
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("ВидДоговора",Перечисления.ВидыДоговоровКонтрагентов.ОтветХранение);
		Рез=Запрос.Выполнить().Выгрузить();
		ТЧ1=Рез;
		
		Запрос=Новый Запрос;
		
		Запрос.Текст=
		"ВЫБРАТЬ
		|	СУММА(ПартииТоваровОстаткиИОбороты.КоличествоРасход) КАК Расход,
		|	СУММА(0) КАК Приход,
		|	ПартииТоваровОстаткиИОбороты.Номенклатура КАК Номенклатура,
		|	ПартииТоваровОстаткиИОбороты.Номенклатура.Артикул КАК Артикул,
		|	ПартииТоваровОстаткиИОбороты.Номенклатура.Изготовитель КАК Изготовитель,
		|	СУММА(ПартииТоваровОстаткиИОбороты.КоличествоНачальныйОстаток) КАК Остаток,
		|	ПартииТоваровОстаткиИОбороты.Склад,
		|	СУММА(0) КАК Цена,
		|	СУММА(0) КАК НеПринято,
		|	СУММА(0) КАК Размещено,
		|	ВложенныйЗапрос.АртикулПоставщика,
		|	ВложенныйЗапрос.ИзготовительПоставщика
		|ИЗ
		|	(ВЫБРАТЬ
		|		НоменклатураКонтрагентов.Номенклатура КАК Номенклатура,
		|		НоменклатураКонтрагентов.Артикул КАК Артикул,
		|		НоменклатураКонтрагентов.Изготовитель КАК Изготовитель,
		|		НоменклатураКонтрагентов.АртикулПоставщика КАК АртикулПоставщика,
		|		НоменклатураКонтрагентов.ИзготовительПоставщика КАК ИзготовительПоставщика
		|	ИЗ
		|		Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
		|	ГДЕ
		|		НоменклатураКонтрагентов.Владелец = &Контрагент) КАК ВложенныйЗапрос
		|		ПРАВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваров.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , ) КАК ПартииТоваровОстаткиИОбороты
		|		ПО ВложенныйЗапрос.Номенклатура = ПартииТоваровОстаткиИОбороты.Номенклатура
		|ГДЕ
		|	ПартииТоваровОстаткиИОбороты.СтатусПартии = &СтатусПартии
		|	И ПартииТоваровОстаткиИОбороты.СтрокаПрихода.ДоговорКонтрагента.ВидДоговора = &ВидДоговора
		|	И ПартииТоваровОстаткиИОбороты.СтрокаПрихода.ДоговорКонтрагента.Владелец = &Контрагент";
		Если НЕ Строка(Склад)="" Тогда 
			Запрос.Текст=Запрос.Текст+"
			|	И ПартииТоваровОстаткиИОбороты.Склад = &Склад";
		КонецЕсли;	
		Запрос.Текст=Запрос.Текст+"
		|
		|СГРУППИРОВАТЬ ПО
		|	ПартииТоваровОстаткиИОбороты.Номенклатура,
		|	ПартииТоваровОстаткиИОбороты.Склад,
		|	ВложенныйЗапрос.ИзготовительПоставщика,
		|	ВложенныйЗапрос.АртикулПоставщика,
		|	ПартииТоваровОстаткиИОбороты.Номенклатура.Артикул,
		|	ПартииТоваровОстаткиИОбороты.Номенклатура.Изготовитель";
		Запрос.УстановитьПараметр("ВидОперацииVMI",Перечисления.ВидыПоступленияТоваров.ОтветХранение);
		Запрос.УстановитьПараметр("НачалоПериода",НачалоДня(НачалоПериода));
		Запрос.УстановитьПараметр("КонецПериода",КонецДня(КонецПериода));
		Запрос.УстановитьПараметр("Склад",Склад);
		Запрос.УстановитьПараметр("СтатусПартии",Перечисления.СтатусыПартии.ПринятыйНаОтветХранение);
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("ВидДоговора",Перечисления.ВидыДоговоровКонтрагентов.ОтветХранение);
		Рез=Запрос.Выполнить().Выгрузить();
		ТЧ2=Рез;
		
		Запрос=Новый Запрос;
		
		Запрос.Текст=
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура КАК НоменклатураПоставщика,
		|	ЦеныНоменклатурыКонтрагентовСрезПоследних.АртикулПоставщика,
		|	ЦеныНоменклатурыКонтрагентовСрезПоследних.ИзготовительПоставщика,
		|	ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.Артикул КАК Артикул,
		|	ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.Изготовитель КАК Изготовитель,
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос.Цена > 0
		|			ТОГДА ВложенныйЗапрос.Цена
		|		ИНАЧЕ ЦеныНоменклатурыКонтрагентовСрезПоследних.Цена
		|	КОНЕЦ КАК Цена,
		|	0 КАК Расход,
		|	0 КАК Приход,
		|	0 КАК Остаток,
		|	0 КАК НеПринято,
		|	0 КАК Размещено
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(&Период, ) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ПереоценкаОстатковПоставщикаТоварыПоставщика.НоменклатураПоставщика КАК НоменклатураКА,
		|			ПереоценкаОстатковПоставщикаТоварыПоставщика.Цена КАК Цена,
		|			ПереоценкаОстатковПоставщикаТоварыПоставщика.ИзготовительПоставщика КАК ИзготовительПоставщика,
		|			ПереоценкаОстатковПоставщикаТоварыПоставщика.АртикулПоставщика КАК АртикулПоставщика,
		|			ПереоценкаОстатковПоставщикаТоварыПоставщика.НоменклатураПоставщика.Номенклатура КАК Номенклатура,
		|			ПереоценкаОстатковПоставщикаТоварыПоставщика.НоменклатураПоставщика.Артикул КАК Артикул,
		|			ПереоценкаОстатковПоставщикаТоварыПоставщика.НоменклатураПоставщика.Изготовитель КАК Изготовитель
		|		ИЗ
		|			Документ.ПереоценкаОстатковПоставщика.ТоварыПоставщика КАК ПереоценкаОстатковПоставщикаТоварыПоставщика
		|		ГДЕ
		|			ПереоценкаОстатковПоставщикаТоварыПоставщика.Ссылка.Дата МЕЖДУ &СегодняНачало И &СегодняКонец
		|			И НЕ ПереоценкаОстатковПоставщикаТоварыПоставщика.Ссылка.Проведен) КАК ВложенныйЗапрос
		|		ПО ВложенныйЗапрос.НоменклатураКА = ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура
		|ГДЕ
		|	ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.Владелец = &КА";
		Запрос.УстановитьПараметр("СегодняКонец", КонецДня(Период));
		Запрос.УстановитьПараметр("СегодняНачало", НачалоДня(Период));
		Запрос.УстановитьПараметр("Период", КонецДня(Период));
		Запрос.УстановитьПараметр("КА", Контрагент);
		Рез=Запрос.Выполнить().Выгрузить();
		ТЧ3=Рез;
		
		Для Каждого СтрокаТЗ ИЗ ТЧ2 Цикл
			НовСтрока = ТЧ1.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаТЗ);
		КонецЦикла;
		Для Каждого СтрокаТЗ ИЗ ТЧ3 Цикл
			НовСтрока = ТЧ1.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаТЗ);
		КонецЦикла;
		ТЧ1.Свернуть("Артикул,Изготовитель,АртикулПоставщика,ИзготовительПоставщика,Склад","Приход,Расход,Цена,Остаток,НеПринято,Размещено");
		МассивУдаляемыхСтрок = Новый Массив;
		Для Каждого Стр Из ТЧ1 Цикл
			Если Стр.Приход=0 И Стр.Расход=0 И Стр.Остаток=0 И Стр.НеПринято=0 И Стр.Размещено=0 Тогда 
				МассивУдаляемыхСтрок.Добавить(Стр);
			КонецЕсли;	
		КонецЦикла;	
		Для Каждого Строка Из МассивУдаляемыхСтрок Цикл
			ТЧ1.Удалить(Строка);
		КонецЦикла;
		ТЧСКЛ=ТЧ1.Скопировать();
		ТЧСКЛ.Свернуть("Склад");
		
		ДокументРезультат=новый ТабличныйДокумент;//ЭлементыФормы.РезультатТЧ;
		//ДокументРезультат.Очистить();
		
		ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		ДокументРезультат.ПолеСверху         = 10;
		ДокументРезультат.ПолеСнизу          = 10;
		ДокументРезультат.ПолеСлева          = 20;
		ДокументРезультат.ПолеСправа         = 20;
		
		ДокументРезультат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Отчет_МХ";
		
		Макет = ПолучитьМакет("Макет");
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		
		ОбластьЗаголовок.Параметры.Поставщик = "Поставщик: "+Строка(Контрагент);
		Попытка
			ОбластьЗаголовок.Параметры.Заголовок = "Остатки с "+строка(НачалоПериода)+" по "+строка(КонецПериода);
		Исключение
		КонецПопытки;	
		//ОбластьЗаголовок.Параметры.Период = Строка(Формат(НачалоПериода,"ДФ=дд.ММ.гг"))+" - "+Строка(Формат(КонецПериода,"ДФ=дд.ММ.гг"));
		ДокументРезультат.Вывести(ОбластьЗаголовок);
		
		Если НЕ Строка(Склад)="" Тогда 
			ОбластьЗаголовок = Макет.ПолучитьОбласть("Шапка");
			ОбластьЗаголовок.Параметры.Цена = "Текущая цена на ("+строка(Период)+")";
			ОбластьЗаголовок.Параметры.Склад = Склад;
			ДокументРезультат.Вывести(ОбластьЗаголовок);
		Иначе 	
			ОбластьЗаголовок = Макет.ПолучитьОбласть("Шапка|Товар");
			ОбластьЗаголовок.Параметры.Цена = "Текущая цена на ("+строка(Период)+")";
			ДокументРезультат.Вывести(ОбластьЗаголовок);
			Для Каждого СтрСК Из ТЧСКЛ Цикл 
				ОбластьСкл = Макет.ПолучитьОбласть("Шапка|Склад");
				ОбластьСкл.Параметры.Склад = СтрСК.Склад;
				ДокументРезультат.Присоединить(ОбластьСкл);
			КонецЦикла;	
		КонецЕсли;	
		
		Итог=0;
		Принято=0;
		Расход=0;
		Для Каждого Стр из ТЧ1 Цикл
			Если НЕ Строка(Склад)="" Тогда 
				ОбластьДок = Макет.ПолучитьОбласть("Строка");
				ОбластьДок.Параметры.АртикулПоставщика = Стр.АртикулПоставщика;
				ОбластьДок.Параметры.Артикул = Стр.Артикул;
				ОбластьДок.Параметры.Изготовитель = Стр.Изготовитель;
				ОбластьДок.Параметры.ИзготовительПоставщика = Стр.ИзготовительПоставщика;
				ОбластьДок.Параметры.Цена = Стр.Цена;
				ОбластьДок.Параметры.Принято = Стр.Остаток+Стр.Приход;
				ОбластьДок.Параметры.НеПринято = Стр.НеПринято;
				ОбластьДок.Параметры.КРазмещению = Стр.Приход-Стр.НеПринято;
				ДокументРезультат.Вывести(ОбластьДок);
			Иначе
				ОбластьДок = Макет.ПолучитьОбласть("Строка|Товар");
				ОбластьДок.Параметры.АртикулПоставщика = Стр.АртикулПоставщика;
				ОбластьДок.Параметры.Артикул = Стр.Артикул;
				ОбластьДок.Параметры.Изготовитель = Стр.Изготовитель;
				ОбластьДок.Параметры.ИзготовительПоставщика = Стр.ИзготовительПоставщика;
				ОбластьДок.Параметры.Цена = Стр.Цена;
				ДокументРезультат.Вывести(ОбластьДок);
				Для Каждого СтрСК Из ТЧСКЛ Цикл 
					ОбластьСКЛ = Макет.ПолучитьОбласть("Строка|Склад");
					Если СтрСК.Склад=Стр.Склад Тогда 
						ОбластьСКЛ.Параметры.Принято = Стр.Остаток+Стр.Приход;
						ОбластьСКЛ.Параметры.НеПринято = Стр.НеПринято;
						ОбластьСКЛ.Параметры.КРазмещению = Стр.Приход-Стр.НеПринято;
					КонецЕсли;	
					ДокументРезультат.Присоединить(ОбластьСКЛ);
				КонецЦикла;	
			КонецЕсли;	
		КонецЦикла;	
		СтрукураВозврата = Новый Структура;
		СтрукураВозврата.Вставить("Результат",ДокументРезультат);
		СтрукураВозврата.Вставить("Ошибка",Ложь);
		СтрукураВозврата.Вставить("ОписаниеОшибк","");
	Исключение
		СтрукураВозврата = Новый Структура;
		СтрукураВозврата.Вставить("Результат",Новый ТаблицаЗначений);
		СтрукураВозврата.Вставить("Ошибка",Истина);
		СтрукураВозврата.Вставить("ОписаниеОшибк",ОписаниеОшибки());
	КонецПопытки;
	Возврат СтрукураВозврата;
КонецФункции
